## Physical FPGA demo constraints
## CNN internal clock: 50 MHz generated by clk_div2_ff + BUFG
## 100 MHz board clock input
set_property PACKAGE_PIN W5 [get_ports {clk}]
set_property IOSTANDARD LVCMOS33 [get_ports {clk}]
create_clock -period 10.000 -name board_clk [get_ports {clk}]
## 50 MHz generated CNN core clock
create_generated_clock -name cnn_core_clk \
    -source [get_ports {clk}] \
    -divide_by 2 \
    [get_pins {cnn_core_clk_buf/O}]
## Buttons
## BTNC -> reset_button
set_property PACKAGE_PIN U18 [get_ports {reset_button}]
set_property IOSTANDARD LVCMOS33 [get_ports {reset_button}]
## BTNU -> start_button
set_property PACKAGE_PIN T18 [get_ports {start_button}]
set_property IOSTANDARD LVCMOS33 [get_ports {start_button}]
## Main status LEDs
## LED0 -> led_done
set_property PACKAGE_PIN U16 [get_ports {led_done}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_done}]
## LED1 -> led_busy
set_property PACKAGE_PIN E19 [get_ports {led_busy}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_busy}]
## LED2 -> led_started
set_property PACKAGE_PIN U19 [get_ports {led_started}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_started}]
## LED3 -> led_pass
set_property PACKAGE_PIN V19 [get_ports {led_pass}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_pass}]
## LED4 -> led_fail
set_property PACKAGE_PIN W18 [get_ports {led_fail}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_fail}]
## Debug/status LEDs
## led_status[0] -> LED5
## led_status[1] -> LED6
## led_status[2] -> LED7
## led_status[3] -> LED8
## led_status[4] -> LED9
set_property PACKAGE_PIN U15 [get_ports {led_status[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_status[0]}]
set_property PACKAGE_PIN U14 [get_ports {led_status[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_status[1]}]
set_property PACKAGE_PIN V14 [get_ports {led_status[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_status[2]}]
set_property PACKAGE_PIN V13 [get_ports {led_status[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_status[3]}]
set_property PACKAGE_PIN V3 [get_ports {led_status[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_status[4]}]
## Button and LED timing treatment
## These are human-speed demo I/O, not high-speed external interfaces.
set_false_path -from [get_ports {reset_button}]
set_false_path -from [get_ports {start_button}]
set_false_path -to [get_ports {led_done}]
set_false_path -to [get_ports {led_busy}]
set_false_path -to [get_ports {led_started}]
set_false_path -to [get_ports {led_pass}]
set_false_path -to [get_ports {led_fail}]
set_false_path -to [get_ports {led_status[*]}]